In [2]:
import pandas as pd
d={'Mouse':[150,200,300,400],
   'Keyboard':[180,200,190,300],
   'Scanner':[200,280,330,450]}
df=pd.DataFrame(d,index=['Jan','Feb','March','April'])

In [3]:
#A
df[['Mouse','Scanner']]

       Mouse  Scanner
Jan      150      200
Feb      200      280
March    300      330
April    400      450

In [4]:
#B
df.Keyboard

Jan      180
Feb      200
March    190
April    300
Name: Keyboard, dtype: int64

In [5]:
#C
df.loc[:, ['Scanner']]

       Scanner
Jan        200
Feb        280
March      330
April      450

In [6]:
df['Mouse'] > 200

Jan      False
Feb      False
March     True
April     True
Name: Mouse, dtype: bool

In [7]:
#D
df[df['Mouse'] > 200]

       Mouse  Keyboard  Scanner
March    300       190      330
April    400       300      450

In [8]:
#E
df.iloc[:,0:2]

       Mouse  Keyboard
Jan      150       180
Feb      200       200
March    300       190
April    400       300

In [16]:
#F
df.loc[['Jan','March'],['Keyboard','Scanner']]

       Keyboard  Scanner
Jan         180      200
March       190      330